// ---------------------------------------Задача 1(34)---------------------------------

// Задайте массив заполненный случайными положительными трёхзначными числами. 
// Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

// int[] array = new int[10]; 
// int index=0;
// for(int count=0;count<10;count++)
// {
//   array[count] = new Random().Next(100,1000);
//   Console.Write($"{array[count]} ");
//   if(array[count]%2==0)
//   {
//     index++;
//   }
// }
// Console.WriteLine($"\nКоличество четных чисел = {index}");

// -----------------------------------Задача 2(36)-------------------------------

//  Задайте одномерный массив, заполненный случайными числами.
//  Найдите сумму элементов, стоящих на нечётных позициях.

// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0

// int[] array = new int[10]; 
// int sum=0;
// int count=0;
// while(count<10)
// {
//   array[count]=new Random().Next(0,5);
//   Console.Write($"{array[count]} ");
//   if (count%2==0)
//   {
//     sum=sum+array[count];
//   }
//   count++;
// }
// Console.WriteLine($"\nСумма нечетных элементов массива = {sum}");

// --------------------------------------------Задача 3(38)-----------------------------

// Задайте массив вещественных чисел. 
// Найдите разницу между максимальным и минимальным элементов массива.

// [3.22, 4.2, 1.15, 77.15, 65.2] => 77.15 - 1.15 = 76

double[] array={3.22,4.2,1.15,77.15,65.2};
double min=array[4];
double max=array[2];
int count=0;
while(count<5)
{
    if(array[count]>max)
    {
      max=array[count];
    }
    else if(array[count]<min)
    {
      min=array[count];
    }
    count++;
}
Console.WriteLine(max-min);